; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Jared Breland <jbreland@legroom.net>
; Homepage:	http://www.legroom.net/mysoft
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-16) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&Гаразд"
CANCEL_BUT = "&Скасувати"
MAIN_DEST_DIR_LABEL = "&Тека призначення:"
MAIN_FILE_LABEL = "&Добути з архіву або інсталятора:"
MENU_FILE_LABEL = "&Файл"
MENU_FILE_QUIT_LABEL = "&Вихід"
MENU_EDIT_LABEL = "&Редакція"
MENU_EDIT_PREFS_LABEL = "&Налаштування"
MENU_OPEN_PASSWORDS_LABEL = "&Відкрити passwords.txt"
MENU_HELP_LABEL = "&Довідка"
MENU_HELP_WEB_LABEL = "&Веб-сайт %s"
MENU_HELP_ABOUT_LABEL = "Про програму"
PREFS_TITLE_LABEL = "Налаштування"
PREFS_UNIEXTRACT_OPTS_LABEL = "Опції Universal Extractor"
PREFS_HISTORY_LABEL = "Зберегти &історію"
PREFS_NODOSWIN_LABEL = "Приховувати вікно консолі"
PREFS_MINDOSWIN_LABEL = "Згорнути вікно консолі"
PREFS_SAVEPASS_LABEL = "Зберігати пароль в списку паролів"
PREFS_FORMAT_OPTS_LABEL = "Опції, особливі для формату"
PREFS_LANG_LABEL = "&Мова"
PREFS_DEBUG_LABEL = "&Зберігати файл налгодження у:"
PREFS_LOG_LABEL = "&Зберігати логфайл у:"
PREFS_LOG_LABEL_ALWAYS = "&Завжди"
PREFS_WARN_EXECUTE_LABEL = "&Повідом. перед викон. файлів"
PREFS_REMOVE_DUPE_LABEL = "&Вилучати дублікати файлів"
PREFS_REMOVE_TEMP_LABEL = "Вилучати &тимчасові файли"
PREFS_APPEND_EXT_LABEL = "&Додати розширення файлів"
METHOD_ADMIN_RADIO = "%s Адміністративний інсталятор"
METHOD_EXTRACTION_RADIO = "Добування %s"
METHOD_HEADER = "Добування %s"
METHOD_MSI_NOTE_LABEL = "Примітка:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml метод вимагає"
METHOD_MSI_URL_LABEL = "Парсер MSXML 6.0"
METHOD_RADIO_LABEL = "Метод добування"
METHOD_SWITCH_RADIO = "Перемикання %s"
METHOD_NOTIS_RADIO = "Інсталятор не InstallShield"
METHOD_TEXT_LABEL = "%s підтримує наступні методи добування%s. На жаль, жоден із цих методів не є надійним на 100 %. Якщо перший метод не працює, будь ласка, запустіть %s ще раз і виберіть альтернативний метод."
METHOD_UNPACKER_RADIO = "Добувач %s"
PE_ANALIZATORS = "Аналізатори PE-файлів"

; GUI control functions
DOES_NOT_EXIST = "не існує.%n"
EXTRACT_TO = "Добути до"
INVALID_DIR_SELECTED =  "Хибна тека %s ."
INVALID_FILE_SELECTED = "%sБудь ласка, виберіть правильний файл."
OPEN_FILE = "Відкрити файл"
SELECT_FILE = "Вибрати файл"
WRITE_TO = "Зберегти до"

; Common terms
TERM_ARCHIVE = "архів"
TERM_COMPRESSED = "стиснутий файл"
TERM_CONTAINER = "контейнер"
TERM_DISK = "диск"
TERM_EBOOK = "електр. книга"
TERM_ECARD = "електр. картка"
TERM_ENCODED = "закодов. файл"
TERM_EXECUTABLE = "ехе-файл"
TERM_FAILED = "невдача"
TERM_HELP = "Файл довідки"
TERM_HOTFIX = "виправлення"
TERM_IMAGE = "образ"
TERM_INSTALLER = "інсталятор"
TERM_MERGE_MODULE = "модулі злиття"
TERM_PACKAGE = "пакунок"
TERM_PATCH = "латка"
TERM_SFX = "Архів, що саморозпаковується""
TERM_SFX = "SFX"
TERM_STAGE = "Стадія"
TERM_SUCCEEDED = "успіх"
TERM_TESTING = "Випробування"
TERM_UNKNOWN = "невідомий"
TERM_UNPACKED = "розпакований"
TERM_UPDATER = "оновлення"

; Status messages
SCANNING_FILE = "Аналіз типу файлу."
SCANNING_EXE = "Аналіз файлу за допомогою %s."
EXTRACTING = "Добування файлів з:"
INIT_WAIT = "Очікування запуску інсталятора.%nБудь ласка, зачекайте."

; Custom prompts
CONVERT_CDROM = "%s образи CD-ROM не можна добувати безпосередньо. Замість цього, цей образ%nбуде перетворено в образ ISO CD-ROM, який потім буде добутий.%n%nБажаєте продовжити?%nПримітка: цей процес буде тривати декілька хвилин."
CONVERT_CDROM_STAGE1_FAILED = "Помилка: Образ CD-ROM не можна перетворити.%nЯкщо це образ BIN/CUE, впевніться, що файл CUE правильно відформатований."
CONVERT_CDROM_STAGE2_FAILED = "Помилка: Образ ISO був створений з образу %s, але він не був перетворений.%nВи хотіли б залишити образ ISO для подальшого аналізу?"
CONVERT_BIN_MISSING = "Помилка: Не знайдено:%n%s\%s. %s%n%nДля роботи необхідні обидва - %s.bin і %s. - файли."
INIT_COMPLETE = "Ініціалізація %s. Вийдіть із інсталятора, потім натисніть "Гаразд", щоб продовжити."
WISE_MSI_PROMPT = "Увага: цей метод працює лише з певними типами пакетів Windows Installer. %nЯкщо Wise Installation Wizard запуститься і підвисне, цей файл не%nпідтримується.  Тоді закрийте інсталятор, і  добування %s буде перерване. %n%nПродовжити?""
UNPACK_PROMPT = "Цей файл запакований з %s стисканням, але може бути добутий. %nМожливо тип файлу не підтримувється, або%nпросто немає файлів, які можна було б добути. %n%nБажаєте розпаковувати цей файл? %n%nПримітка: Розпакований файл буде названий:%n%s\%s_unpacked."
UNPACK_FAILED = "Помилка: %s%nне може бути розпакований.%nПодробиці див. у лог-файлі %s.%n%nНатисніть "Гаразд", щоб подивитись лог-файл, або "Скасувати", щоб вийти."
WARN_EXECUTE = "Попередження:  Для того, щоб добувати файли цього типу, файл повинен безпосередньо виконуватися.%nЯкщо ви продовжите, буде запущена наступна команда:%n%n%s%n%nЯкщо ви вважаєте, що цей файл, можливо, ворожий, рекомендується не продовжувати.%nВи бажаєте продовжити добування?"
WARN_FILE_EXIST = "Увага: Неможливо створити теку %s, так як існує файл %s.%nБажаєте розпакувати в теку %s_extracted?%n%n%tТАК - розпакування в теку %s_extracted%n%tНІ - вибір теки призначення%n%tСКАСУВАТИ - розпакування в теку %s_%s"
WARN_DIR_EXIST = "Увага: Тека призначення %s вже існує! Бажаєте спорожнити теку перед розпакуванням?%n%n%tТАК - Спорожнити теку та розпакувати%n%tНІ - вибір теки призначення%n%tСКАСУВАТИ - розпакування в теку %s без стирання"
DOTNET_FAILED = "Помилка: Для работи %s повинен бути встановлений .Net Framework %s"
ASK_PASSWORD = "Для розпакування потрібен пароль.%nЖоден зі списку паролів (passwords.txt) не підходить.%nВведіть пароль для розпакування"
MOVE_COPY_FILES = "Переміщення/Копіювання:"
TO =  ""%s" у "%s""

; Help text
HELP_SUMMARY = "Добування файлів з архіву будь-якого типу або інсталяційного пакету."
HELP_SYNTAX = "%nВикористовувати:  %s [/help] [filename [destination]]"
HELP_ARGUMENTS = "%n%nПідтримувані параметри:"
HELP_HELP = "%n     /довідка%t%tПоказати довідку"
HELP_PREFS = "%n     /зміна%t%tЗмінити налаштування UniExtract"
HELP_LANG = "%n     /lang <lang>%tЗміна мови інтерфейсу.%n%t%t<lang> Ім'я мовного файлу *.ini"
HELP_FILENAME = "%n     ім'я%tІм’я файлу, що видобувається"
HELP_DESTINATION = "%n     призначення%tТека для видобування"
HELP_SUB = "%n%nВказівка /sub замість імені теки призначення змусить%n%s видобувати у підтеку, названу іменем архіву."
HELP_EXAMPLE1 = "%n%nПриклад:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nПри запуску %s без параметрів буде поставлений запит%nпро ім'я файлу і теку призначення."

; Error messages
CANNOT_LOG = "Добування %s неможливо записати в лог."
CANNOT_DEBUG = "В теці файлу налагодження, "%s", заборонено збереження.%nЗамість неї використовуватиметься ваша тимчасова тека."
CANNOT_EXTRACT = "%s неможливо витягти. %nТип файлу: %s%n%nНатисніть "Гаразд", якщо хочете аналізувати файл, або "Скасувати", щоб вийти.
UNKNOWN_EXT = "%s%nмає невідоме розширення і не може бути добутий."
INVALID_DIR = "%s%nне створена. Виберіть правильну адресу."
EXTRACT_FAILED = "%s не можливо витягти. %nВидобування цього %s, можливо і підтримується, але воно закінчилося невдало. %nПодробиці див. у лог-файлі %s. %n%nНатисніть "Гаразд", щоб переглянути лог-файл, або "Скасувати", щоб вийти."
INVALID_PASSWORD = "%s  не можливо витягти.%n%nФайл захищений за допомогою пароля і пароль, введений вами не підходить.%n%nТакож не підходить жоден зі списку паролів (passwords.txt), котрий знаходиться в теці Universal Extractor-а."
INVALID_LANGFILE = "Не вдалося знайти мовний файл %s. Використовуватиметься попередня мова інтерфейсу."

; Log
APPEND_EXTENSIONS = "Додавання розширень до файлів за допомогою TrID в теці "%s""
ARCHIVE = "архівом"
ASKED_PASSWORD = "Запит пароля у користувача"
COMLINE_PARAMETRS = "запущений з параметрами комрядка:"
COPY_FILES = "Скопійовано: "%s" у "%s""
DEBUG_FILE = "Файл відладки:"
DEL_FILES = "Вилучено: "%s""
DELETE_FILE = "Видалення файлу:"
DEST_DIR = "Тека призначення:"
DIR_CREATE = "Створена тека: "%s""
DIR_EXIST = "Тека призначення "%s" вже існує"
ERROR_READING_OPTION = "Помилка зчитування опції:  %s --> %s"
EXECUTING = "Рядок запуску:"
EXTRACT_FAILE = ""%s" не може бути видобуто. Видобування цього "%s", можливо підтримується, але воно невдале."
EXTRACT_SUCCESS = "Розпакування успішно завершена"
EXTRACTING_7ZIP = "Видобування файлу конфігурації та sfx-модуля з SFX-архіву"
EXTRACTING_CPIO = "Видобування з вкладеного файлу CPIO для RPM пакету Linux"
EXTRACTING_DEB = "Видобування з вкладеного файлу TAR для Debian пакету Linux"
FAILED_COPY = "Помилка при копіюванні: "%s" в "%s""
FAILED_CREATE = "Помилка при створенні: "%s""
FAILED_DEL = "Помилка при видаленні: "%s""
FAILED_MOVE = "Помилка при переміщенні: "%s" в "%s""
FALSE_TESTING = "Файл не є"
FILE_EXIST = Неможливо створити теку призначення "%s", так як існує файл "%s"
FILE_PROCESSING = "Файл для обробки:"
FILE_PROPERTIES = "Властивості файлу:"
FILE_UNICODE = "Імовірно в імені вихідного файлу або в шляху до нього містяться символи Юнікоду. Вихідний файл буде переміщений/скопійований в тимчасову теку"
FILE_VER = "Версія файлу:"
FIRST = "Перевіряється розширення файлу на необхідність застосування спеціальних методів розпакування"
FOURTH = "Використовується розширення файлу для розпакування, оскільки сигнатура не розпізнана"
INSTALLER = "інсталятором"
LANG_INTERFACE = "Мова інтерфейсу змінена на"
LOG = "Лог роботи:"
MATCH_PATTERN = "Перевірка на збіг з відомими паттернами"
MOVE_FILES = "Переміщено: "%s" у "%s""
NO_MATCH = "Збігів, не знайдено"
NOT_TRANLATION = "Не вдалося знайти переклад для виразу: %s"
OPTION = "Опція: %s = %s"
PASSWORD_FOUND = "Знайдено пароль: %s"
PASSWORDS = "Файл захищено паролем"
PRODUCT_NAME = "Назва продукту:"
READING_FROM = "Читання налаштувань з"
REGISTRY = "реєстру"
RUN_OPTION = "Робочий каталог: "%s".  Режим відображення програми що запускається: %s"
SAVE_PASSWORD = "Збереження паролю у списку паролів (passwords.txt)"
SAVE_PREF = "Збереження налаштувань"
SAVING = "Збереження: %s = %s"
SAVING_TO = "Збереження в"
SCANNING_EPE_EXTERNAL = "Сканування за допомогою зовнішньої бази сигнатур"
SCANNING_EPE_STANDART = "Сканування за допомогою внутрішньої бази сигнатур"
SCRIPT = "скомпільованим скриптом"
SECOND = "Аналіз файлу за допомогою TrID"
SET_PATH = "Змінна середовища "Path" ="
START_FILESCAN = "Запуск сканування файлу "%s" за допомогою %s"
TEMP_UNICODE = "Шлях до теки для тимчасових файлів містить символи Юнікоду, скасування"
THIRD = "Аналіз виконуваного файлу"
TRYING_PASSWORDS = "Перевірка %s паролів(я) зі списку паролів (passwords.txt)"
UNICODE_BACK = "Зворотне копіювання\переміщення вихідного файлу з тимчасової теки"
UNPACK = "Розпакування стиснутих виконуваних файлів. Пакувальник: "%s""
UNPACK_FAILE = "Помилка: "%s" не може бути розпакований."
WARN_TRANLATION = "Увага: вираз "%s" не визначено"
WITHOUT_COMLINE_PARAMETRS = "запущений без параметрів комрядку"

[Installer]
; Components page
COMP_DOCS = "Документація і ліцензійна інформація"
COMP_LANG = "Мовні файли"
COMP_ACE = "Підтримка файлів ACE"
COMP_KGB = "Підтримка файлів KGB"
COMP_PEA = "Підтримка файлів Pea"
COMP_SIT = "Підтримка файлів StuffIt"

; Preferences page
PREFS_CAPTION = "Встановити опції програми"
PREFS_DESCRIPTION = "Які опції Universal Extractor'а Ви хочете змінити?"
PREFS_LABEL1 = "Можна привести наступні опції до стандартних значень."
PREFS_LABEL2 = "Ці опції можуть бути змінені після встановлення шляхом редакції файлу UniExtract.ini."
LANGUAGE_LABEL = "Мова"
DEBUG_LABEL = "Розташування файлу налагодження"
APPEND_EXT_LABEL = "&Додавати відсутні розширення файлів"
HISTORY_LABEL = "&Зберігати історію архіву"
REMOVE_DUPE_LABEL = "Вилучати &дублікати файлів"
REMOVE_TEMP_LABEL = "Вилучати &тимчасові файли"
WARN_EXECUTE_LABEL = "&Попереджувати перед виконанням файлів"

; Tasks page
ASSOCIATE = "&Додати в контекстне меню  Провідника"
ASSOCIATE_FILES = "Додати 'UniExtract &файли' у контекстне меню"
ASSOCIATE_HERE = "Додати 'UniExtract &в цю теку' у контекстне меню"
ASSOCIATE_SUBDIR = "Додати 'UniExtract в &теку' контекстне меню"
ASSOCIATE_FORCE = "Примусово &асоціювати з усіма підтримуваними форматами пакунків"
MODIFY_PATH = "Додати Universal Extractor в System &Path"
DESKTOP_ICON = "Створити ярлик &на робочому столі"
QUICK_LAUNCH_ICON = "Створити ярлик &на панелі швидкого запуску"
SENDTO_ICON = "Створити ярлик в меню 'Відправити'"

; Context Menu integration
EXTRACT_FILES = "UniExtract &файли"
EXTRACT_HERE = "UniExtract &в цю теку"
EXTRACT_SUB = "UniExtract в &теку"

